In [8]:
import pandas as pd
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 1. Display Top 3 rows of the dataset

In [9]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# 2. Display last 3 rows of the dataset

In [10]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 3. Find Shape of our Dataset (Number of rows & Number of Columns)

In [11]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [12]:
df1.shape

(7, 3)

In [13]:
print('Number of rows:',df1.shape[0])
print('Number of columns:',df1.shape[1])

Number of rows: 7
Number of columns: 3

# 4. Get Information About our dataset like total number of rows , total number of columns , datatypes of each column and memory requirement

In [14]:
df1.info()
# df1.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

# 5. Check null values in the dataset

In [15]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [16]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [20]:
df1.isnull().sum(axis=1) #finds row-wise null values

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [17]:
df1.isnull().sum(axis=0) #finds column-wise null values

Name      0
Marks     0
Gender    0
dtype: int64

# 6. Get Overall statistics about the dataframe

In [18]:
df1.describe() # displayed for only numerical columns

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [19]:
df1.describe(include='all') # displayed for all columns

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

# 7. Find Unique values from the Gender column

In [20]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [21]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

# 8. Find Number of Unique values from the Gender Column

In [22]:
df1['Gender'].nunique()

2

# 9. Display Count of Unique Values from the Gender Column

In [23]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

# 10. Find total number of students having marks between 90 to 100 (inclusive) using between method

In [24]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [25]:
# df1[df1['Marks']>=90 & df1['Marks']<=100]
df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [26]:
df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [27]:
len(df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)])

4

In [28]:
df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [29]:
sum(df1['Marks'].between(90,100))

4

# 11. Find Average Marks

In [30]:
df1['Marks'].mean()

92.14285714285714

# 12. Apply Method

In [31]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [32]:
def marks(x):
    return x/2

df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [33]:
df1['Half_Marks']=df1['Marks'].apply(marks)

In [34]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [35]:
df1['Marks'].apply(lambda x: x//2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [36]:
df1['Half_Marks_Float_Div']=df1['Marks'].apply(lambda x: x//2)

In [37]:
df1

      Name  Marks  Gender  Half_Marks  Half_Marks_Float_Div
0  Priyang     98    Male        49.0                    49
1   Aadhya     89  Female        44.5                    44
2   Krisha     99  Female        49.5                    49
3   Vedant     87    Male        43.5                    43
4   Parshv     90    Male        45.0                    45
5   Mittal     83  Female        41.5                    41
6  Archana     99  Female        49.5                    49

In [38]:
df1['Name'].apply(len) # displays len of each string of name

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

# 13. Map Function

In [39]:
df1

      Name  Marks  Gender  Half_Marks  Half_Marks_Float_Div
0  Priyang     98    Male        49.0                    49
1   Aadhya     89  Female        44.5                    44
2   Krisha     99  Female        49.5                    49
3   Vedant     87    Male        43.5                    43
4   Parshv     90    Male        45.0                    45
5   Mittal     83  Female        41.5                    41
6  Archana     99  Female        49.5                    49

In [40]:
df1['Gender'].map({'Male':1,'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [41]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [42]:
df1

      Name  Marks  Gender  Half_Marks  Half_Marks_Float_Div  Male_Female
0  Priyang     98    Male        49.0                    49            1
1   Aadhya     89  Female        44.5                    44            0
2   Krisha     99  Female        49.5                    49            0
3   Vedant     87    Male        43.5                    43            1
4   Parshv     90    Male        45.0                    45            1
5   Mittal     83  Female        41.5                    41            0
6  Archana     99  Female        49.5                    49            0

# 14. Drop the Columns

In [45]:
df1.drop('Half_Marks',axis=1,inplace=False) #does impact df1

      Name  Marks  Gender  Half_Marks_Float_Div  Male_Female
0  Priyang     98    Male                    49            1
1   Aadhya     89  Female                    44            0
2   Krisha     99  Female                    49            0
3   Vedant     87    Male                    43            1
4   Parshv     90    Male                    45            1
5   Mittal     83  Female                    41            0
6  Archana     99  Female                    49            0

In [46]:
df1

      Name  Marks  Gender  Half_Marks  Half_Marks_Float_Div  Male_Female
0  Priyang     98    Male        49.0                    49            1
1   Aadhya     89  Female        44.5                    44            0
2   Krisha     99  Female        49.5                    49            0
3   Vedant     87    Male        43.5                    43            1
4   Parshv     90    Male        45.0                    45            1
5   Mittal     83  Female        41.5                    41            0
6  Archana     99  Female        49.5                    49            0

In [47]:
df1.drop('Half_Marks',axis=1,inplace=True) #df1 is impacted Half_Marks is dropped , changes done in-place

In [48]:
df1

      Name  Marks  Gender  Half_Marks_Float_Div  Male_Female
0  Priyang     98    Male                    49            1
1   Aadhya     89  Female                    44            0
2   Krisha     99  Female                    49            0
3   Vedant     87    Male                    43            1
4   Parshv     90    Male                    45            1
5   Mittal     83  Female                    41            0
6  Archana     99  Female                    49            0

In [49]:
df1.drop(['Half_Marks_Float_Div','Male_Female'],axis=1,inplace=True)

In [50]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 15. Print Name of Columns

In [51]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [52]:
df1.index

RangeIndex(start=0, stop=7, step=1)

# 16. Sort the dataframe as per the marks column

In [58]:
df1.sort_values(by='Marks') # sorted but no changes in df1

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [60]:
df1

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [63]:
df1.sort_values(by='Marks',inplace=True) # sorted and inplace in df1

In [64]:
df1

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [65]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [66]:
df1

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [69]:
df1.sort_values(by='Marks',ascending=False,inplace=True) # sorted descending and inplace df1

In [70]:
df1

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [72]:
df1.sort_values(by=['Marks','Gender'],inplace=False,ascending=True)

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [73]:
df1

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [74]:
df1.sort_values(by=['Marks','Gender'],inplace=True,ascending=True)

In [75]:
df1

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

# 17. Display Name & Marks of the Female Students

In [76]:
df1

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [79]:
df1[df1['Gender']=='Female']

      Name  Marks  Gender
5   Mittal     83  Female
1   Aadhya     89  Female
2   Krisha     99  Female
6  Archana     99  Female

In [85]:
df1[df1['Gender'].isin(['Female'])]

      Name  Marks  Gender
5   Mittal     83  Female
1   Aadhya     89  Female
2   Krisha     99  Female
6  Archana     99  Female

In [88]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
5   Mittal     83
1   Aadhya     89
2   Krisha     99
6  Archana     99